#include <stdio.h>
int main(int argc,char** argv) {
    /* 
    一维数组: 
    			数组首地址:a
                首列地址: a+0
    二维数组:
    			数组首地址:a
                首行地址(移动一行):a+0, &a[0]
                首列地址(移动一列):*(a+0),*a, a[0]
    
    一维数组中: *(a+i)<==>a[i]
    
    a     :数组的地址.
    a+i  :数组首行的地址.
    a[i]  :数组行中列的地址.
    *(a+i):数组行中列的地址.
    &a[i][0]:首元素的地址.
    */
    /* 
    因为在内存中,
    二维数组是按行,纵向存储的,
    (行指针和列指针相互转换)
    a+i :行指针一次移动一行 <=> *(a+i):列指针一次移动一列
    a[i] :列指针一次移动一列 <=> &a[i]:行指针一次移动一行
    */
    /*
    数组的地址值 
           <=> 
    数组首行的地址值 
           <=> 
    数组首列的地址值 
           <=> 
    数组首元素的地址值
    */
    /*
    值相等,含义不同.
    数组  行     行        列       列      元素
    a<=>a+0<=>&a[0]<=>*(a+0)<=>a[0]<=>a[i][0] 
    */
    /*
    当前行的地址值  <=>  当前行首列的地址值
            <=>                  <=>
       a+i <=> &a[i]  <=>  a[i] <=> *(a+i)
    */
    int a[2][3] = {{5,3,2},{4,8,7}};
    printf("数组地址		a:%u\n",a);
    printf("数组的首行地址		a+0:%u\n",a+0);
    printf("数组的首行地址		&a[0]:%u\n",&a[0]);
    printf("数组的首列地址		*(a+0):%u\n",*(a+0));
    printf("数组的首列地址		a[0]:%u\n",a[0]);
    printf("数组首列的首元素地址	&a[0][0]:%u\n",&a[0][0]);
    printf("*********************************\n");
    printf("数组地址		a:%u\n",a);
    printf("第一行地址  a+0:%u &a[0]:%u\n", a+0,&a[0]);
    printf("第一列地址*(a+0):%u a[0]:%u\n", *(a+0),a[0]);
    printf("第二行地址   a+0:%u &a[0]:%u\n", a+1,&a[1]);
    printf("第二列地址 *(a+1):%u a[1]:%u\n", *(a+1),a[1]);
}
